### Assets

# These are the visuals

# Colors 🟦🟪🟥⬜🟩

# Clouds

$left = "🟥🟥🟥🟥🟥⬜⬜⬜⬜⬜⬜⬜⬜⬜⬜\n🟥🟥🟥🟥🟥⬜⬜⬜⬜⬜⬜⬜⬜⬜⬜\n🟥🟥🟥🟥🟥⬜⬜⬜⬜⬜⬜⬜⬜⬜⬜\n🟥🟥🟥🟥🟥⬜⬜⬜⬜⬜⬜⬜⬜⬜⬜"
$middle = "⬜⬜⬜⬜⬜🟥🟥🟥🟥🟥⬜⬜⬜⬜⬜\n⬜⬜⬜⬜⬜🟥🟥🟥🟥🟥⬜⬜⬜⬜⬜\n⬜⬜⬜⬜⬜🟥🟥🟥🟥🟥⬜⬜⬜⬜⬜\n⬜⬜⬜⬜⬜🟥🟥🟥🟥🟥⬜⬜⬜⬜⬜"
$right = "⬜⬜⬜⬜⬜⬜⬜⬜⬜⬜🟥🟥🟥🟥🟥\n⬜⬜⬜⬜⬜⬜⬜⬜⬜⬜🟥🟥🟥🟥🟥\n⬜⬜⬜⬜⬜⬜⬜⬜⬜⬜🟥🟥🟥🟥🟥\n⬜⬜⬜⬜⬜⬜⬜⬜⬜⬜🟥🟥🟥🟥🟥"

# Dudes

$guy_left = "⬜⬜🟪⬜⬜⬜⬜⬜⬜⬜⬜⬜⬜⬜⬜\n⬜🟦🟦🟦⬜⬜⬜⬜⬜⬜⬜⬜⬜⬜⬜\n⬜⬜🟦⬜⬜⬜⬜⬜⬜⬜⬜⬜⬜⬜⬜\n⬜🟦⬜🟦⬜⬜⬜⬜⬜⬜⬜⬜⬜⬜⬜"
$guy_mid = "⬜⬜⬜⬜⬜⬜⬜🟪⬜⬜⬜⬜⬜⬜⬜\n⬜⬜⬜⬜⬜⬜🟦🟦🟦⬜⬜⬜⬜⬜⬜\n⬜⬜⬜⬜⬜⬜⬜🟦⬜⬜⬜⬜⬜⬜⬜\n⬜⬜⬜⬜⬜⬜🟦⬜🟦⬜⬜⬜⬜⬜⬜"
$guy_right = "⬜⬜⬜⬜⬜⬜⬜⬜⬜⬜⬜⬜🟪⬜⬜\n⬜⬜⬜⬜⬜⬜⬜⬜⬜⬜⬜🟦🟦🟦⬜\n⬜⬜⬜⬜⬜⬜⬜⬜⬜⬜⬜⬜🟦⬜⬜\n⬜⬜⬜⬜⬜⬜⬜⬜⬜⬜⬜🟦⬜🟦⬜"

# Line Break
$line = Array.new(65, "=").join("")

# Hell Win
$win = "🟢🟢🟢🟢🟢🟢🟢🟢🟢🟢\n🟢🟢🟢🟢🟢🟢🟢🟢🟢🟢\n🟢🟢🟢🟢🟢🟢🟢🟢🟢🟢\n🟢🟢🟢🟢🟢🟢🟢🟢🟢🟢"

# Pull Arrays
$clouds = [$left, $middle, $left, $right, $middle, $right]
$dudes = [$guy_left, $guy_mid, $guy_right]

# Scoreboard
$high_score = 0
$current_score = 0



